app/Models/AbsenModel.php

    public function getfirstAbsen()
    {
        $result = $this->db->table('absensi')
        ->join('pegawai', 'absensi.pgw_id = pegawai.pgw_id')
        ->where('absensi.pgw_id',user()->getpgwId())
        ->where('absensi.abs_tgl', date('Y-m-d'))
        ->orderBy('abs_tgl','desc')
        ->limit(1)
        ->get();
---
SELECT *
FROM `absensi`
JOIN `pegawai` ON `absensi`.`pgw_id` = `pegawai`.`pgw_id`
WHERE `absensi`.`pgw_id` = '211201238'
AND `absensi`.`abs_tgl` = '2022-06-09'
ORDER BY `abs_tgl` DESC
 LIMIT 1

    public function get_abs_by_id($id) {
        $result = $this->db->table('absensi')
        ->join('pegawai', 'absensi.pgw_id = pegawai.pgw_id')
        ->where('absensi.pgw_id', user()->getpgwid())
        ->where('abs_id', $id)
        ->get();
---
SELECT *
FROM `absensi`
JOIN `pegawai` ON `absensi`.`pgw_id` = `pegawai`.`pgw_id`
WHERE `absensi`.`pgw_id` = '211201238'
AND `abs_id` = '320'

    public function getuserdata()
    {
        $result = $this->db->table('pegawai')
        ->join('users', 'pegawai.pgw_id = users.pgw_id')
        ->where('pegawai.pgw_id',user()->getpgwId())
        ->limit(1)
        ->get();
---
SELECT *
FROM `pegawai`
JOIN `users` ON `pegawai`.`pgw_id` = `users`.`pgw_id`
WHERE `pegawai`.`pgw_id` = '211201238'
 LIMIT 1

    public function getStatus()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->distinct()
                ->get();
---
SELECT DISTINCT `abs_status`
FROM `absensi`
WHERE `pgw_id` = '211201238'

    public function getCountBekerja()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->like('abs_status', 'Bekerja')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_status` LIKE '%Bekerja%' ESCAPE '!'
AND  `abs_tgl` LIKE '%2022-06%' ESCAPE '!'

    public function getCountWFH()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->like('abs_status', 'WFH')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_status` LIKE '%WFH%' ESCAPE '!'
AND  `abs_tgl` LIKE '%2022-06%' ESCAPE '!'

    public function getCountTanpaKet()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->where('abs_status', 'Tanpa Keterangan')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND `abs_status` = 'Tanpa Keterangan'
AND  `abs_tgl` LIKE '%2022-06%' ESCAPE '!'

    public function getCountCuti()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->like('abs_status','Cuti')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_status` LIKE '%Cuti%' ESCAPE '!'
AND  `abs_tgl` LIKE '%2022-06%' ESCAPE '!'

    public function getCountDL()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->where('abs_status','Dinas Luar')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND `abs_status` = 'Dinas Luar'
AND  `abs_tgl` LIKE '%2022-06%' ESCAPE '!'