app/Models/ActivityModel.php

    public function getChartKinerjatigaBulan()
    {
        $result = $this->db->table('activity')
                ->select('act_qty, act_tgl')
                ->where('pgw_id', user()->getpgwId())
                ->where('act_tgl BETWEEN "' . date('Y-m-d', strtotime('-3 Months')) . '" AND "' .date('Y-m-d').'"')
                ->orderBy('act_tgl', 'asc')
                ->groupBy('act_tgl')
                ->get();
---
SELECT `act_qty`, `act_tgl`
FROM `activity`
WHERE `pgw_id` = '211201238'
AND  `act_tgl` LIKE '%2022-07%' ESCAPE '!'
GROUP BY `act_tgl`
ORDER BY `act_tgl` ASC