app/Models/PresensiModel.php

    public function getStatus()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->distinct()
                ->get();
---
SELECT DISTINCT `abs_status`
FROM `absensi`
WHERE `pgw_id` = '211201238'