app/Models/PresensiModel.php

    public function getfirstAbsen()
    {
        $result = $this->db->table('absensi')
        ->join('pegawai', 'absensi.pgw_id = pegawai.pgw_id')
        ->where('absensi.pgw_id',user()->getpgwId())
        ->where('absensi.abs_tgl', date('Y-m-d'))
        ->orderBy('abs_tgl','desc')
        ->limit(1)
        ->get();
---
SELECT *
FROM `absensi`
JOIN `pegawai` ON `absensi`.`pgw_id` = `pegawai`.`pgw_id`
WHERE `absensi`.`pgw_id` = '211201238'
AND `absensi`.`abs_tgl` = '2022-07-20'
ORDER BY `abs_tgl` DESC
 LIMIT 1

    public function get_abs_by_id($id) {
        $result = $this->db->table('absensi')
        ->join('pegawai', 'absensi.pgw_id = pegawai.pgw_id')
        ->where('abs_id', $id)
        ->get();

        return $result->getRow();
---
SELECT *
FROM `absensi`
JOIN `pegawai` ON `absensi`.`pgw_id` = `pegawai`.`pgw_id`
WHERE `absensi`.`pgw_id` = '211201238'
AND `abs_id` = '386'
SELECT *
FROM `pegawai`
JOIN `users` ON `pegawai`.`pgw_id` = `users`.`pgw_id`
WHERE `pegawai`.`pgw_id` = '211201238'
 LIMIT 1
SELECT *
FROM `absensi`
JOIN `pegawai` ON `absensi`.`pgw_id` = `pegawai`.`pgw_id`
WHERE `absensi`.`pgw_id` = '211201238'
AND `abs_id` = '2yc7yymnhxxu'

    public function getuserdata()
    {
        $result = $this->db->table('pegawai')
        ->select('pegawai.hmb_id, homebase.hmb_name, pegawai.nama, pegawai.jabatan, pegawai.pgw_id')
        ->join('users', 'pegawai.pgw_id = users.pgw_id')
        ->join('homebase', 'pegawai.hmb_id = homebase.hmb_id')
        ->where('pegawai.pgw_id', user()->getpgwId())
        ->get();
---
SELECT `pegawai`.`hmb_id`, `homebase`.`hmb_name`, `pegawai`.`nama`, `pegawai`.`jabatan`, `pegawai`.`pgw_id`
FROM `pegawai`
JOIN `users` ON `pegawai`.`pgw_id` = `users`.`pgw_id`
JOIN `homebase` ON `pegawai`.`hmb_id` = `homebase`.`hmb_id`
WHERE `pegawai`.`pgw_id` = '211201238'

    public function getStatus()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->distinct()
                ->get();
---
SELECT DISTINCT `abs_status`
FROM `absensi`

    public function getCountBekerja()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->like('abs_status', 'Bekerja')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_status` LIKE '%Bekerja%' ESCAPE '!'
AND  `abs_tgl` LIKE '%2022-07%' ESCAPE '!'

    public function getCountWFH()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->like('abs_status', 'WFH')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_status` LIKE '%WFH%' ESCAPE '!'
AND  `abs_tgl` LIKE '%2022-07%' ESCAPE '!'

    public function getCountTanpaKet()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->where('abs_status', 'Tanpa Keterangan')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND `abs_status` = 'Tanpa Keterangan'
AND  `abs_tgl` LIKE '%2022-07%' ESCAPE '!'

    public function getCountCuti()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->like('abs_status','Cuti')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_status` LIKE '%Cuti%' ESCAPE '!'
AND  `abs_tgl` LIKE '%2022-07%' ESCAPE '!'

    public function getCountDL()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->where('pgw_id', user()->getpgwId())
                ->where('abs_status','Dinas Luar')
                ->like('abs_tgl',date('Y-m'))
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND `abs_status` = 'Dinas Luar'
AND  `abs_tgl` LIKE '%2022-07%' ESCAPE '!'

    public function getChartStatus()
    {
        $result = $this->db->table('absensi')
                ->select('abs_status')
                ->select("count(*) AS total")
                ->where('pgw_id', user()->getpgwId())
                ->like('abs_tgl',date('Y-m'))
                ->groupBy('abs_status')
                ->get();
---
SELECT `abs_status`, count(*) AS total
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_tgl` LIKE '%2022-07%' ESCAPE '!'
GROUP BY `abs_status`

    public function getChartJamKerja()
    {
        $result = $this->db->table('absensi')
                ->select('abs_jamkerja, abs_tgl')
                ->where('pgw_id', user()->getpgwId())
                ->where('abs_status !=', 'Hari Libur')
---
SELECT `abs_status`, count(*) AS total
FROM `absensi`
WHERE `pgw_id` = '211201238'
AND  `abs_tgl` LIKE '%2022-07%' ESCAPE '!'
GROUP BY `abs_status`